const TelegramApi = require ('node-telegram-bot-api')

const token ='5841472247:AAHpkPj-qN_iI6v_Uptoh7WfJhvcYGr8L-g'

const bot = new TelegramApi(token, {polling: true})

bot.on("message",  async msg=>
{
    const text = msg.text;
    const chatId = msg.chat.id;

    if (text === '/start')
    {
       return  bot.sendMessage(chatId, 'Приветствую тебя! \nЭтот бот содержит информацию о расписании звонков и пар проходящих у Беллы и Айдара. \nЧтобы воспользоваться, укажите в сообщении: \n{Имя} {День недели}\nНапример: Белла понедельник');
    }

    if (text === 'Белла понедельник')
    {
        return  bot.sendMessage(chatId,'4 пара(13.20): Математические методы искусственного интеллекта \nКабинет: У406\n\n5 пара(14:50): Математические методы искусственного интеллекта \nКабинет: У406\n\n6 пара(16.20): Математические методы искусственного интеллекта \nКабинет: У105')
    }

    if (text === 'Белла вторник')
    {
        return  bot.sendMessage(chatId,'1 пара(8.30): Мехатронные комплексы \nКабинет: У403\n\n2 пара(10.00): Математические методы искусственного интеллекта(Лекция) \nКабинет: У903\n\n3 пара(11.30): Математические методы искусственного интеллекта(Лекция) \nКабинет: У903')
    }

    if (text === 'Белла среда')
    {
        return  bot.sendMessage(chatId,'2 пара(10.00): Экономика и организация производства(Лекция)\nКабинет: K609\n\n3 пара(11.30): Экономика и организация производства(Практика) \nКабинет: У903')
    }

    if (text === 'Белла четверг')
    {
        return  bot.sendMessage(chatId,'3 пара(Числитель)(11.30): Основы подготовки технической документации(Практика) \nКабинет: У408\n\n4 пара(11.30): Автоматизированные информационно-управляющие(Лекция) \nКабинет: У106\n\n5 пара(11.30): Автоматизированные информационно-управляющие(Лекция)  \nКабинет: У106')
    }

    if (text === 'Белла пятница')
    {
        return  bot.sendMessage(chatId,'2 пара(10.00): Системы управления базами данных\nКабинет: Дистанционно\n\n3 пара(11.30): Системы управления базами данных \nКабинет: Дистанционно')
    }

    if (text === 'Белла суббота')
    {
        return  bot.sendMessage(chatId,'2 пара(10.00): Системы управления базами данных(Лекция)\nКабинет: Дистанционно\n\n3 пара(11.30): Системы управления базами данных(Лекция) \nКабинет: Дистанционно')
    }

    if (text === 'Белла воскресенье')
    {
        return  bot.sendMessage(chatId,'Умница, что рвёшься к знаниям! Но сегодня у тебя нет пар)\nОтдыхай <3')
    }

    if (text === 'Айдар понедельник')
    {
        return  bot.sendMessage(chatId,'2 пара(10.00): Методы оптимизации(Лекция)\nКабинет: К506\n\n3 пара(11.30): Интелектуальные системы и технологии(Лекция)\nКабинет: К506\n\n7 пара(18.00): Администрирование в информационных системах(Лекция)\nКабинет: Дистанционно')
    }

    if (text === 'Айдар вторник')
    {
        return  bot.sendMessage(chatId,'2 пара(10.00):\nЧислитель: Моделирование систем(Лекция); Кабинет: У505\nЗнаменатель: Объектно-ориентированное программирование(Лекция); Кабинет: У505\n3 пара(11:30):\nЧислитель: Объектно-ориентированное программирование(Практика)\nКабинет: У802')
    }

    if (text === 'Айдар среда')
    {
        return  bot.sendMessage(chatId,'1 пара(8.30): Интеллектуальные системы и технологии\nКабинет: У606\n\n2 пара(10.00): Моделирование систем\nКабинет: У606')
    }

    if (text === 'Айдар четверг')
    {
        return  bot.sendMessage(chatId,'5 пара(14.50): Методы оптимизации\nКабинет: К503\n\n6 пара(16.20): Иностранный язык в проф. сфере\nКабинет: К504')
    }

    if (text === 'Айдар пятница')
    {
        return  bot.sendMessage(chatId,'2 пара(10.30): Плавание\nВодолей\n\n4 пара(13.20): Научно-исследовательская работа\nКабинет: У606\n\n5-6 пара(14.50-16.20): Администрирование в ИС\nКабинет: У606')
    }

    if (text === 'Айдар суббота')
    {
        return  bot.sendMessage(chatId,'2 пара(10.00): Большие данные(Лекция)\nКабинет: У506\n\n3 пара(11.30):\nЧислитель: Большие данные(Практика)\nКабинет: У607')
    }

    if (text === 'Айдар воскресенье')
    {
        return  bot.sendMessage(chatId,'Умница, что рвёшься к знаниям! Но сегодня у тебя нет пар)\nОтдыхай <3')
    }
    return bot.sendMessage(chatId,'Я тебя не понимаю!\nПопробуй действовать по условию!)')
})